XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/std_drv/inc/bl606p_romdriver_e907.h
} ROM_API_INDEX_e;

/*@} end of group ROMDRIVER_Public_Types */

/** @defgroup  ROMDRIVER_Public_Constants
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Constants */

/** @defgroup  ROMDRIVER_Public_Macros
 *  @{
 */


#define ROM_APITABLE            ((uint32_t *)0x90014800)


#define RomDriver_AON_LowPower_Enter_PDS0                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_LowPower_Enter_PDS0])

#define RomDriver_AON_LowPower_Exit_PDS0                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_LowPower_Exit_PDS0])

#define RomDriver_AON_Power_Off_BG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_BG])

#define RomDriver_AON_Power_Off_LDO15_RF                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_LDO15_RF])

#define RomDriver_AON_Power_Off_MBG                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_MBG])

#define RomDriver_AON_Power_Off_SFReg                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_SFReg])

#define RomDriver_AON_Power_Off_XTAL                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_XTAL])

#define RomDriver_AON_Power_On_BG                         \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_BG])

#define RomDriver_AON_Power_On_LDO15_RF                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_LDO15_RF])

#define RomDriver_AON_Power_On_MBG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_MBG])

#define RomDriver_AON_Power_On_SFReg                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_SFReg])

#define RomDriver_AON_Power_On_XTAL                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_XTAL])

#define RomDriver_AON_Set_Xtal_CapCode                    \
    ((BL_Err_Type (*) (uint8_t capIn, uint8_t capOut))ROM_APITABLE[ROM_API_INDEX_AON_Set_Xtal_CapCode])

#define RomDriver_AON_Get_Xtal_CapCode                    \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Get_Xtal_CapCode])

#define RomDriver_CPU_MTimer_Delay_MS                     \
    ((BL_Err_Type (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_CPU_MTimer_Delay_MS])

#define RomDriver_CPU_MTimer_Delay_US                     \
    ((BL_Err_Type (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_CPU_MTimer_Delay_US])

#define RomDriver_CPU_Reset_MTimer                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Reset_MTimer])

#define RomDriver_CPU_Set_MTimer_CLK                      \
    ((BL_Err_Type (*) (uint8_t enable, uint16_t div))ROM_APITABLE[ROM_API_INDEX_CPU_Set_MTimer_CLK])

#define RomDriver_CPU_Set_MTimer_RST                      \
    ((BL_Err_Type (*) (uint8_t rstEn))ROM_APITABLE[ROM_API_INDEX_CPU_Set_MTimer_RST])

#define RomDriver_CPU_Get_MTimer_Clock                    \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_Clock])

#define RomDriver_CPU_Get_MTimer_Source_Clock             \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_Source_Clock])

#define RomDriver_Clock_Audio_ADC_Clock_Get               \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_Clock_Audio_ADC_Clock_Get])

#define RomDriver_Clock_Audio_DAC_Clock_Get               \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_Clock_Audio_DAC_Clock_Get])

#define RomDriver_Clock_Get_EMI_Clk                       \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_Clock_Get_EMI_Clk])

#define RomDriver_Clock_Get_PSRAMB_Clk                    \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_Clock_Get_PSRAMB_Clk])

#define RomDriver_Clock_Peripheral_Clock_Get              \
    ((uint32_t (*) (BL_Peripheral_Type type))ROM_APITABLE[ROM_API_INDEX_Clock_Peripheral_Clock_Get])

#define RomDriver_Clock_System_Clock_Get                  \
    ((uint32_t (*) (BL_System_Clock_Type type))ROM_APITABLE[ROM_API_INDEX_Clock_System_Clock_Get])

#define RomDriver_SystemCoreClockGet                      \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_SystemCoreClockGet])

#define RomDriver_CPU_Get_CPU_Cycle                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_CPU_Cycle])

#define RomDriver_CPU_Get_MTimer_Counter                  \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_Counter])

#define RomDriver_CPU_Get_MTimer_MS                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_MS])

#define RomDriver_CPU_Get_MTimer_US                       \
    ((uint64_t (*) (void))ROM_APITABLE[ROM_API_INDEX_CPU_Get_MTimer_US])

#define RomDriver_ASM_Delay_Us                            \
    ((void (*) (uint32_t core, uint32_t cnt, uint32_t loopT))ROM_APITABLE[ROM_API_INDEX_ASM_Delay_Us])

#define RomDriver_arch_delay_ms                           \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_arch_delay_ms])

#define RomDriver_arch_delay_us                           \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_arch_delay_us])

#define RomDriver_EF_Ctrl_Crc_Result                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Crc_Result])

#define RomDriver_EF_Ctrl_Get_Customer_PIDVID             \
    ((BL_Err_Type (*) (uint16_t pid[1], uint16_t vid[1]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Get_Customer_PIDVID])

#define RomDriver_EF_Ctrl_Read_Chip_ID                    \
    ((BL_Err_Type (*) (uint8_t chipID[8]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Chip_ID])

#define RomDriver_EF_Ctrl_Read_MAC_Address                \
    ((BL_Err_Type (*) (uint8_t mac[6]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_MAC_Address])

#define RomDriver_EF_Ctrl_Read_MAC_Address_Raw            \
    ((BL_Err_Type (*) (uint8_t mac[7]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Raw])

