XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/std_drv/inc/bl606p_romdriver_e907.h
#define RomDriver_GLB_Set_DSP_SPI_0_ACT_MOD_Sel           \
    ((BL_Err_Type (*) (GLB_SPI_PAD_ACT_AS_Type mod))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_SPI_0_ACT_MOD_Sel])

#define RomDriver_GLB_Set_DSP_SPI_CLK                     \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_SPI_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_SPI_CLK])

#define RomDriver_GLB_Set_DSP_System_CLK                  \
    ((BL_Err_Type (*) (GLB_DSP_SYS_CLK_Type clkFreq))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_System_CLK])

#define RomDriver_GLB_Set_DSP_System_CLK_Div              \
    ((BL_Err_Type (*) (uint8_t dspClkDiv, uint8_t dspBclkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_System_CLK_Div])

#define RomDriver_GLB_Set_DSP_UART0_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_UART_CLK_Type uartClk, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_UART0_CLK])

#define RomDriver_GLB_Set_DSP_UART1_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_UART_CLK_Type uartClk, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_UART1_CLK])

#define RomDriver_GLB_Set_DSP_XCLK_Sel                    \
    ((BL_Err_Type (*) (GLB_DSP_XCLK_Type xclk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_XCLK_Sel])

#define RomDriver_GLB_Set_EMI_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_EMI_CLK_Type clkSel, uint32_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_EMI_CLK])

#define RomDriver_GLB_Set_EM_Sel                          \
    ((BL_Err_Type (*) (GLB_EM_Type emType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_EM_Sel])

#define RomDriver_GLB_Set_ETH_REF_O_CLK_Sel               \
    ((BL_Err_Type (*) (GLB_ETH_REF_CLK_OUT_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_ETH_REF_O_CLK_Sel])

#define RomDriver_GLB_Set_Ethernet_CLK_From_UHSPLL        \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Ethernet_CLK_From_UHSPLL])

#define RomDriver_GLB_Set_Flash_IO_PARM                   \
    ((BL_Err_Type (*) (uint8_t selEmbedded, uint8_t swap))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Flash_IO_PARM])

#define RomDriver_GLB_Set_I2C_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_I2C_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_I2C_CLK])

#define RomDriver_GLB_Set_I2S_CLK                         \
    ((BL_Err_Type (*) (uint8_t refClkEn, uint8_t refClkDiv, GLB_I2S_DI_REF_CLK_Type inRef, GLB_I2S_DO_REF_CLK_Type outRef))ROM_APITABLE[ROM_API_INDEX_GLB_Set_I2S_CLK])

#define RomDriver_GLB_Set_IR_CLK                          \
    ((BL_Err_Type (*) (uint8_t enable, GLB_IR_CLK_SRC_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_IR_CLK])

#define RomDriver_GLB_Set_MCU_MTimer_CLK                  \
    ((BL_Err_Type (*) (uint8_t enable, uint16_t div, uint8_t rst))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_MTimer_CLK])

#define RomDriver_GLB_Set_MCU_Muxpll_160M_Sel             \
    ((BL_Err_Type (*) (GLB_MCU_MUXPLL_160M_CLK_SEL_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_Muxpll_160M_Sel])

#define RomDriver_GLB_Set_MCU_Muxpll_80M_Sel              \
    ((BL_Err_Type (*) (GLB_MCU_MUXPLL_80M_CLK_SEL_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_Muxpll_80M_Sel])

#define RomDriver_GLB_Set_MCU_SPI_0_ACT_MOD_Sel           \
    ((BL_Err_Type (*) (GLB_SPI_PAD_ACT_AS_Type mod))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_SPI_0_ACT_MOD_Sel])

#define RomDriver_GLB_Set_MCU_System_CLK                  \
    ((BL_Err_Type (*) (GLB_MCU_SYS_CLK_Type clkFreq))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_System_CLK])

#define RomDriver_GLB_Set_MCU_System_CLK_Div              \
    ((BL_Err_Type (*) (uint8_t mcuClkDiv, uint8_t mcuPBclkDiv, uint8_t lpClkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Set_MCU_System_CLK_Div])

#define RomDriver_GLB_Set_PADC_CLK                        \
    ((BL_Err_Type (*) (uint8_t enable, uint16_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PADC_CLK])

#define RomDriver_GLB_Set_PDM_IO_Sel                      \
    ((BL_Err_Type (*) (GLB_PDM_IO_SEL_Type ioSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PDM_IO_Sel])

#define RomDriver_GLB_Set_PKA_CLK_Sel                     \
    ((BL_Err_Type (*) (GLB_PKA_CLK_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PKA_CLK_Sel])

#define RomDriver_GLB_Set_PSram_CLK                       \
    ((BL_Err_Type (*) (uint8_t id, uint8_t enable, GLB_PSRAM_PLL_Type pll, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PSram_CLK])

#define RomDriver_GLB_Set_PWM1_IO_Sel                     \
    ((BL_Err_Type (*) (GLB_PWM1_IO_SEL_Type ioSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PWM1_IO_Sel])

#define RomDriver_GLB_Set_PWM2_IO_Sel                     \
    ((BL_Err_Type (*) (GLB_PWM2_IO_SEL_Type ioSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_PWM2_IO_Sel])

#define RomDriver_GLB_Set_Peripheral_DMA_CN               \
    ((BL_Err_Type (*) (GLB_PERI_DMA_Type peri, GLB_PERI_DMA_CN_SEL_Type cn))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Peripheral_DMA_CN])

#define RomDriver_GLB_Set_SDH_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_SDH_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SDH_CLK])

#define RomDriver_GLB_Set_SF_CLK                          \
    ((BL_Err_Type (*) (uint8_t enable, GLB_SFLASH_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SF_CLK])

#define RomDriver_GLB_Set_SPI_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_SPI_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SPI_CLK])

#define RomDriver_GLB_Set_SRAM_PARM                       \
    ((BL_Err_Type (*) (uint32_t value))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SRAM_PARM])

#define RomDriver_GLB_Set_SRAM_RET                        \
    ((BL_Err_Type (*) (uint32_t value))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SRAM_RET])

#define RomDriver_GLB_Set_SRAM_SLP                        \
    ((BL_Err_Type (*) (uint32_t value))ROM_APITABLE[ROM_API_INDEX_GLB_Set_SRAM_SLP])

#define RomDriver_GLB_Set_UART2_IO_Sel                    \
    ((BL_Err_Type (*) (GLB_UART2_IO_SEL_Type ioType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_UART2_IO_Sel])

#define RomDriver_GLB_Set_UART_CLK                        \
    ((BL_Err_Type (*) (uint8_t enable, HBN_UART_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_UART_CLK])

